brew "git"
brew "ripgrep"
brew "fd"
brew "bat"
brew "zoxide"
brew "atuin"
brew "eza"
brew "sd"
brew "fzf"
brew "jq"
brew "gh"
brew "lazygit"
brew "lazydocker"
brew "direnv"
brew "node"
brew "pnpm"
tap "oven-sh/bun"
brew "oven-sh/bun/bun"
brew "fish"
brew "fisher"
brew "pylsp"
brew "ffmpeg"
brew "libheif"
brew "uv"
brew "gemini-cli"
brew "opencode"
brew "neovim"

cask "raycast"
cask "rectangle"
cask "chatgpt"
cask "1password"
cask "font-hack-nerd-font"
cask "ghostty"
cask "discord"
cask "spotify"
cask "tableplus"
cask "maccy"
cask "zed"
cask "codex"
cask "obsidian"
cask "chatgpt-atlas"
cask "antigravity"
cask "notion"

hostname = `hostname`.strip
if hostname == "koichiro-mac-work"
  brew "azure-cli"
  brew "grpcurl"

  cask "gather"
  cask "jetbrains-toolbox"
  cask "microsoft-azure-storage-explorer"
  cask "powershell"
  cask "visual-studio-code"
  cask "rancher"
else
  cask "orbstack"
  cask "brave-browser"
end
